**Novita Purwonintyas | Batch 8**

#Membuat data frame

In [2]:
#import library yang akan digunakan
import pandas as pd

In [11]:
data = {'Nama':['Sinta', 'Rachel', 'Wisnu', 'Budi', 'Lita', 'Nita', 'Danu', 'Nina', 'Ani', 'Lisa'],
        'Tempat_lahir':['Depok', 'Jakarta', 'Bandung', 'Surabaya', 'Denpasar', 'Jakarta', 'Bekasi', 'Depok', 'Jakarta', 'Sulawesi'],
        'Tanggal_lahir':['01/11/1998', '20/09/1997', '13/01/2000', '25/10/1999', '09/12/2003', '10/11/1993', '18/06/1965', '09/07/1995', '07/07/1997', '12/12/2001'],
        'Tanggal_terakhir_belanja':['09/11/2021', '15/11/2021', '19/11/2021', '21/11/2021', '08/11/2021', '26/11/2021', '06/11/2021', '11/11/2021', '23/11/2021', '20/11/2021'],
        'Rata_rata_amount/bulan':[150000, 200000, 79000, 110000, 99000, 101000, 90000, 250000, 300000, 89000],
        'Total_transaksi/bulan':[2, 3, 6, 1, 8, 10, 7, 3, 2, 6]}
df = pd.DataFrame(data, index=[1,2,3,4,5,6,7,8,9,10])
df

      Nama Tempat_lahir  ... Rata_rata_amount/bulan Total_transaksi/bulan
1    Sinta        Depok  ...                 150000                     2
2   Rachel      Jakarta  ...                 200000                     3
3    Wisnu      Bandung  ...                  79000                     6
4     Budi     Surabaya  ...                 110000                     1
5     Lita     Denpasar  ...                  99000                     8
6     Nita      Jakarta  ...                 101000                    10
7     Danu       Bekasi  ...                  90000                     7
8     Nina        Depok  ...                 250000                     3
9      Ani      Jakarta  ...                 300000                     2
10    Lisa     Sulawesi  ...                  89000                     6

[10 rows x 6 columns]

#Filtering data customer terloyal

In [12]:
df[
   (df['Rata_rata_amount/bulan'] > 100000) & (df['Total_transaksi/bulan'] > 5)]

   Nama Tempat_lahir  ... Rata_rata_amount/bulan Total_transaksi/bulan
6  Nita      Jakarta  ...                 101000                    10

[1 rows x 6 columns]

Filtering data diatas menampilan cutomer terloyal yang rata - rata amount belanja/bulaya > 100.000 dan total transaksi perbulanya > 5 transaksi.